Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/phpmyadmin-5-2.tmx
Source language: en
Languages: sv

source: Persistent recently used tables:
sv: Beständiga nyligen använda tabeller:

source: Is deterministic
sv: Är deterministisk

source: @SERVER@ will become the server name and @DATABASE@ will become the database name.
sv: @SERVER@ blir servernamnet och @DATABASE@ blir databasnamnet.

source: Account locking is not supported.
sv: Kontolåsning stöds inte.

source: Too many sorts are causing temporary tables.
sv: Alltför många sorteringar orsakar temporära tabeller.

source: Sort:
sv: Sortera:

source: Connections
sv: Anslutningar

source: Database tree separator
sv: Avskiljare för databasträd

source: Check for latest version
sv: Sök efter senaste version

source: Browse your computer:
sv: Gå igenom din dator:

source: Tracking for %1$s was activated at version %2$s.
sv: Spårning av %1$s aktiverades vid version %2$s.

source: You allow for connecting to the server without a password.
sv: Du tillåter anslutning till servern utan lösenord.

source: Configuration has been saved.
sv: Konfigurationen har sparats.

source: You are about to DESTROY a complete database!
sv: Du är på väg att RADERA en hel databas!

source: Sent
sv: Skickade

source: The number of row locks currently being waited for.
sv: Antalet radlås som för närvarande väntas på.

source: Central columns
sv: Huvud-kolumner

source: Display media types
sv: Visa MIME-typer

source: Please enter a value between {0} and {1} characters long
sv: Ange ett värde som är {0} eller {1} tecken långt

source: FOREIGN KEY relationship has been added.
sv: Främmande nyckel-relation har lagts till.

source: Percentage of used open files limit
sv: Procentandel av gränsen för använda öppna filer

source: Date and time
sv: Datum och tid

source: Export views as tables
sv: Exportera vyer som tabeller

source: Row statistics
sv: Radstatistik

source: Remove last parameter
sv: Ta bort senaste parametern

source: Empty phpMyAdmin control user while using phpMyAdmin configuration storage!
sv: Tom phpMyAdmin-kontrollanvändare vid användning av konfigurationslagring för phpMyAdmin!

source: Allow root login
sv: Tillåt root-inloggning

source: Total swap
sv: Totalt växlingsutrymme

source: Connection:
sv: Anslutning:

source: Show SQL query
sv: Visa SQL-fråga

source: Configuration contains incorrect data for some fields.
sv: Konfiguration innehåller felaktiga data för vissa fält.

source: Display order:
sv: Visningsordning:

source: There are no triggers to display.
sv: Det finns inga triggers att visa.

source: SSL is used without certification authority
sv: SSL används utan certifikatutfärdare

source: Only INSERT, UPDATE, DELETE and REPLACE SQL queries containing transactional engine tables can be rolled back.
sv: Enda Infoga, uppdatera, ta bort och ersätta SQL-körningar som innehåller transaktionella tabeller kan rullas tillbaka.

source: Ungroup queries
sv: Dela upp frågor

source: Report
sv: Rapport

source: The maximum amount of used connections is getting close to the value of {max_connections}.
sv: Det maximala antalet av använda anslutningar börjar närma sig värdet på {max_connections}.

source: The number of requests to insert a row in a table.
sv: Antalet efterfrågningar att lägga till en rad i en tabell.

source: The number of INSERT DELAYED handler threads in use. Every different table on which one uses INSERT DELAYED gets its own thread.
sv: Antalet INSERT DELAYED-hanteringstrådar i bruk. Varje tabell på vilken man använder INSERT DELAYED får sin egen tråd.

source: SQL query
sv: SQL-fråga

source: Startup
sv: Uppstart

source: Value
sv: Värde

source: The %s extension is missing. Please check your PHP configuration.
sv: Tillägget %s saknas. Vänligen kontrollera din PHP-konfiguration.

source: Add/Delete columns:
sv: Lägg till/ta bort kolumner:

source: Enable drag and drop import
sv: Aktivera import med dra och släpp

source: Generate
sv: Generera

source: When browsing tables, the sorting of each table is remembered.
sv: Vid bläddring i tabeller är sorteringen av varje tabell ihågkommen.

source: Directory [code]config[/code], which is used by the setup script, still exists in your phpMyAdmin directory. It is strongly recommended to remove it once phpMyAdmin has been configured. Otherwise the security of your server may be compromised by unauthorized people downloading your configuration.
sv: Katalogen [code]config[/code], som används av installationsskriptet, finns fortfarande i din phpMyAdmin-katalog. Det rekommenderas kraftigt att ta bort den när phpMyAdmin har konfigurerats. I annat fall kan din servers säkerhet hotas av obehöriga som laddar ner din konfiguration.

source: Enables check for latest version on main phpMyAdmin page.
sv: Aktivera kontroll efter senaste version på phpMyAdmins hemsida.

source: "PRIMARY" <b>must</b> be the name of and <b>only of</b> a primary key!
sv: "PRIMARY" <b>måste</b> vara namnet på och <b>endast på</b> en primärnyckel!

source: Delete version
sv: Ta bort version

source: Click
sv: Klicka

source: Remove carriage return/line feed characters within columns
sv: Ta bort radbrytning inom kolumner

source: Browser display transformation options
sv: Webbläsaromvandling

source: New page name
sv: Nytt sidnamn

source: Once you restarted MySQL server, please click on Go button. Afterwards, you should see a message informing you, that this server <strong>is</strong> configured as primary.
sv: När du har startat om MySQL-servern klickar du på knappen Kör. Därefter bör du se ett meddelande om att servern <strong>är</strong> konfigurerad som primär.

source: Query cache min result size
sv: Minimal resultatstorlek för frågecache

source: The rate of reading the first index entry is high.
sv: Frekvensen av att läsa första indexpost är hög.

source: Primary key already exists.
sv: Primär nyckel finns redan.

source: This %soption%s should be disabled as it allows attackers to bruteforce login to any MySQL server. If you feel this is necessary, use %srestrict login to MySQL server%s or %strusted proxies list%s. However, IP-based protection with trusted proxies list may not be reliable if your IP belongs to an ISP where thousands of users, including you, are connected to.
sv: Denna %soption%s ska inaktiveras eftersom det gör att angripare kan "tvångsinlogga" till MySQL server. Om du känner att detta är nödvändigt, Använd %srestrict login tp MySQL server%s eller %strusted proxies list%s. IP-baserade skydd med betrodda fullmakter kanske inte tillförlitlig om din IP tillhör en ISP där tusentals användare är anslutna.

source: %1$sGZip compression and decompression%2$s requires functions (%3$s) which are unavailable on this system.
sv: %1$sKomprimering och dekomprimering med GZip%2$s kräver funktioner (%3$s) som inte är tillgängliga på systemet.

source: Set to 0 to collapse navigation panel.
sv: Ange 0 för att fälla ihop navigeringspanelen.

source: Two-factor authentication
sv: Tvåfaktorsautentisering

source: routine
sv: Rutin

source: Show create
sv: Visa/Skapa

source: SQL queries
sv: SQL-frågor

source: Partial import: allow interrupt
sv: Partiell import: tillåt avbrott

source: The best way to tune your system would be to change only one setting at a time, observe or benchmark your database, and undo the change if there was no clearly measurable improvement.
sv: Det bästa sättet att trimma ditt system är att bara ändra en inställning i taget, iaktta eller benchmarka databasen, och ångra den förändring om det inte fanns någon tydligt mätbar förbättring.

source: Queries are executed by pressing Enter (instead of Ctrl+Enter). New lines will be inserted with Shift+Enter.
sv: Sökningar utförs genom att trycka på RETUR (i stället för Ctrl+Retur). Nya rader infogas med SKIFT+RETUR.

source: You can set more settings by modifying config.inc.php, eg. by using %sSetup script%s.
sv: Du kan ställa in fler inställningar genom att ändra config.inc.php, t ex. genom att använda %sSetup script%s.

source: Display features:
sv: Visningsfunktioner:

source: Apply a divisor
sv: Tillämpa en dividend

source: Add index
sv: Lägg till index

source: Databases
sv: Databaser

source: You should upgrade to %s %s or later.
sv: Du bör uppgradera till %s %s eller senare.

source: Increasing {max_heap_table_size} and {tmp_table_size} might help. However some temporary tables are always being written to disk, independent of the value of these variables. To eliminate these you will have to rewrite your queries to avoid those conditions (Within a temporary table: Presence of a BLOB or TEXT column or presence of a column bigger than 512 bytes) as mentioned in the <a href="https://dev.mysql.com/doc/refman/8.0/en/internal-temporary-tables.html">MySQL Documentation</a>
sv: Att öka {max_heap_table_size} och {tmp_table_size} kan hjälpa. Men vissa temporära tabeller skrivs alltid till disk, oberoende av vilka värden dessa variabler har. För att eliminera dessa måste du skriva om dina frågor för att undvika dessa villkor (Inom en temporär tabell: Förekomst av en BLOB- eller TEXT-kolumn eller förekomsten av en kolumn större än 512 byte) som nämns i <a href="https://dev.mysql.com/doc/refman/8.0/en/internal-temporary-tables.html">MySQL-dokumentationen</a>

source: general_log and slow_query_log are enabled.
sv: general_log och slow_query_log är aktiverade.

source: Include table caption
sv: Inkludera tabellbeskrivning

source: Thread cache hitrate: %s%%, this value should be above 80%%
sv: Träffandel för trådad cache: %s%%, detta värde bör vara över 80%%

source: You might want to increase {long_query_time} or optimize the queries listed in the slow query log
sv: Du kanske vill öka {long_query_time} eller optimera de frågor som anges i den långsamma sökfrågeloggen

source: Database client version:
sv: Databasens klientversion:

source: Limits number of table preferences which are stored in database, the oldest records are automatically removed.
sv: Begränsar antalet tabellpreferenser som lagras i databasen, de äldsta posterna tas bort automatiskt.

source: + Add column
sv: + Lägg till kolumn

source: There are no routines to display.
sv: Det finns inga rutiner att visa.

source: You must provide a trigger name!
sv: Du måste ange ett triggernamn!

source: Values for a new column
sv: Värden för ny kolumn

source: Could not load class "%1$s"
sv: Kunde inte läsa in klassen ”%1$s”

source: Maximum table tree depth
sv: Max djup i tabellträd

source: Analyse query
sv: Analysera frågan

source: Database server
sv: Databas-server

source: Label:
sv: Etikett:

source: Shift+Click to add this column to ORDER BY clause or to toggle ASC/DESC.<br>- Ctrl+Click or Alt+Click (Mac: Shift+Option+Click) to remove column from ORDER BY clause
sv: Skift-klicka för att lägga till kolumnen i "SORTERA VID"-sats eller att växla ASC/DESC.<br>-Ctrl-klicka eller Alt-klicka (Mac: Skift+Alt+klicka) för att ta bort kolumnen från SORTERA VID-instruktionen

source: Read requests
sv: Läsförfrågningar

source: The number of fsync() operations so far.
sv: Antalet fsync()-operationer hittills.

source: Permanent query history
sv: Permanent frågehistorik

source: Partitioned by:
sv: Partitionerade av:

source: Refresh
sv: Uppdatera

source: Sat
sv: Lör

source: Leave blank for no [doc@bookmarks@]bookmark[/doc] support, suggested: [kbd]pma__bookmark[/kbd]
sv: Lämna tomt för att stänga av [doc@bookmarks@]bokmärken[/doc], förslag: [kbd]pma_bookmark[/kbd]

source: SQL Query box
sv: SQL-frågeruta

source: Column names
sv: Kolumnnamn

source: Do you want to copy encryption key?
sv: Vill du kopiera krypteringsnyckeln?

source: New column name
sv: Nytt kolumnnamn

source: Version %1$s was created for selected tables, tracking is active for them.
sv: Version %1$s är skapad, spårning är aktiverad.

source: Good
sv: Bra

source: Page-related settings
sv: Sida-relaterade inställningar

source: Profiling results
sv: Profilering av resultat

source: Disable two-factor authentication
sv: Inaktivera tvåfaktorsautentisering

source: SQL statements exported. Please copy the dump or execute it.
sv: SQL-satser exporteras. Kopiera dump eller verkställ.

source: File upload stopped by extension.
sv: Filuppladdning stoppades av tillägg.

source: Compressed import will not work due to missing function %s.
sv: Komprimerad import fungerar inte på grund av saknad funktion %s.

source: Mark used tables and make it possible to show databases with locked tables.
sv: Markera använda tabeller och gör det möjligt att visa databaser med låsta tabeller.

source: Show %1$s with dates from %2$s to %3$s by user %4$s %5$s
sv: Visa %1$s med datum från %2$s till %3$s av användare %4$s %5$s

source: Instructions
sv: Instruktioner

source: Lock
sv: Lås

source: Procedure
sv: Procedur

source: Storage engine
sv: Lagringsmotor

source: Thread cache hit rate (calculated value)
sv: Trådad cache träffrekvens (beräknat värde)

source: Similar to the CHAR type, but stores binary byte strings rather than non-binary character strings
sv: Liknande typen CHAR, men lagrar binära bytesträngar snarare än icke-binära teckensträngar

source: Define whether the previous login should be recalled or not in [kbd]cookie[/kbd] authentication mode.
sv: Ange om den tidigare inloggningen ska återkallas eller inte vid [kbd]cookie[/kbd]-autentiseringsläge.

source: Define how long (in seconds) a login cookie is valid.
sv: Anger hur lång tid (i sekunder) som en inloggnings-cookie är giltig.

source: Importing into the current server
sv: Importera till den aktuella servern

source: Default transformations for TextImageLink
sv: Standardomvandlingar för TextImageLink

source: Change password
sv: Byt lösenord

source: Spanish (modern)
sv: Spanska (modern)

source: Explain output
sv: Förklara utdata

source: There are no configured servers
sv: Det finns inga konfigurerade servrar

source: Please look at the bottom of this window.
sv: Titta längst ned i fönstret.

source: Use GZip output buffering for increased speed in HTTP transfers.
sv: Använd GZip utmatningsbuffer för ökad hastighet i HTTP-överföringar.

source: Existing configuration file (%s) is not readable.
sv: Befintlig konfigurationsfil (%s) är inte läsbar.

source: Edit user group
sv: Redigera användargrupp

source: Title of browser window when a table is selected.
sv: Titel på webbläsarfönstret när en tabell är markerad.

source: Primary connection:
sv: Primäranslutning:

source: Japanese
sv: Japansk

source: There are lots of rows being sorted.
sv: Det är många rader som blir sorterade.

source: Latvian
sv: Lettisk

source: The maximum number of connections that have been in use simultaneously since the server started.
sv: Det maximala antalet anslutningar som har använts samtidigt sedan servern startade.

source: A newer version of phpMyAdmin is available and you should consider upgrading. The newest version is %s, released on %s.
sv: En nyare version av phpMyAdmin finns tillgänglig och du bör uppgradera. Den senaste versionen är %s, publicerad den %s.

source: Columns enclosed with:
sv: Kolumner omges av:

source: Persistent connections
sv: Bestående anslutningar

source: Log SQL queries and their execution time, to be displayed in the console
sv: Logga SQL-sökningar och genomförandetid, för senare visning i konsolen

source: Too many clients are aborted.
sv: Alltför många klienter avbryts.

source: Press escape to cancel editing.<br>- Shift+Enter for a newline.
sv: Tryck på Esc för att avbryta redigeringen.<br>- Skift+Retur för en ny rad.

source: The number of rows inserted in InnoDB tables.
sv: Antalet rader tillagda i InnoDB-tabeller.

source: Spatial column
sv: Spatial kolumn

source: Display as differential value
sv: Visa som skillnadsvärde

source: Disable
sv: Inaktivera

source: Constraints for dumped tables
sv: Restriktioner för dumpade tabeller

source: The rate of reading the next table row is high.
sv: Frekvensen av läsning av nästa tabellrad är hög.

source: Not used on MariaDB.
sv: Används inte i MariaDB.

source: Edit structure by following the "Structure" link.
sv: Redigera strukturen genom att följa länken "Struktur".

source: Dump has been saved to file %s.
sv: Dump har sparats till filen %s.

source: Hide/show navigation items:
sv: Visa/dölj navigeringsobjekt:

source: Password hashing method
sv: Metod för lösenordshashning

source: Failed to set session cookie. Maybe you are using HTTP instead of HTTPS to access phpMyAdmin.
sv: Det gick inte att ange sessionscookien. Du använder kanske HTTP i stället för HTTPS för att öppna phpMyAdmin.

source: kana-sensitive
sv: Kanakänslig

source: Log buffer size
sv: Bufferstorlek för logg

source: Find transitive dependencies
sv: Hitta transitiva beroenden

source: SQL history:
sv: SQL-historik:

source: Allows dropping tables.
sv: Tillåter borttagning av tabeller.

source: Add %s statement
sv: Lägg till uppgiften %s

source: Rate of aborted connections
sv: Andelen avbrutna anslutningar

source: Add privileges on the following table:
sv: Lägg till privilegier till följande tabell:

source: Enable if you want DB-based query history (requires phpMyAdmin configuration storage). If disabled, this utilizes JS-routines to display query history (lost by window close).
sv: Aktivera om du vill ha DB-baserad frågehistorik (kräver phpMyAdmin konfigurationslagring). Om inakiverad, så används JS-rutiner för att visa frågehistorik (förloras när fönstret stängs).

source: A fixed-point number (M, D) - the maximum number of digits (M) is 65 (default 10), the maximum number of decimals (D) is 30 (default 0)
sv: Ett fast-punkt nummer (M, D) - det maximala antalet siffror (M) är 65 (default 10), det maximala antalet decimaler (D) är 30 (default 0)

source: Links to
sv: Länkar till

source: Export table names
sv: Exportera tabellnamn

source: Columns separated with:
sv: Kolumnerna avslutas med:

source: Max % MyISAM key buffer ever used
sv: Högsta användning av MyISAM-nyckelbuffert: %

source: Opening tables requires disk I/O which is costly. Increasing {table_open_cache} might avoid this.
sv: Öppna tabeller kräver disk I/O som är dyrt. Att öka {table_open_cache} kan lösa detta.

source: The curl extension was not found and allow_url_fopen is disabled. Due to this some features such as error reporting or version check are disabled.
sv: Curl-tillägget kunde inte hittas och allow_url_fopen är avstängt. På grund av detta är vissa funktioner, som felrapportering och versionskontroll, avstängda.

source: all of the words
sv: alla ord

source: Table level tabs
sv: Flikar på tabellnivå

source: Query cache disabled
sv: Frågecache inaktiverad

source: German (phone book order)
sv: Tysk (telefonboksordning)

source: You must provide a valid interval value for the event.
sv: Du måste ange ett giltigt intervallvärde för händelsen.

source: A collection of curves with linear interpolation between points
sv: En samling kurvor med linjär interpolering mellan punkterna

source: See [doc@authentication-modes]authentication types[/doc] for an example.
sv: Se [doc@authentication-modes]autentiseringstyper[/doc] för ett exempel.

source: This table does not contain a unique column. Features related to the grid edit, checkbox, Edit, Copy and Delete links may not work after saving.
sv: Denna tabell innehåller inte en unik kolumn. Funktioner relaterade till nätet redigera, kryssruta, redigera, kopiera och radera-länkar kanske inte fungerar när du har sparat.

source: Save to browser's storage
sv: Spara till webbläsaren

source: Extremely weak
sv: Extremt svag

source: Do you really want to remove partitioning?
sv: Vill du verkligen ta bort partitionering?

source: Checksum
sv: Kontrollsumma

source: Allows changing data.
sv: Tillåter ändring av data.

source: Your InnoDB buffer pool is fairly small.
sv: Din InnoDB buffer pool är relativt liten.

source: Empty signon session name while using [kbd]signon[/kbd] authentication method!
sv: Tomt sessionsnamn för signon vid användning av [kbd]signon[/kbd]-autentisering!

source: Cannot save UI property "%s". The changes made will not be persistent after you refresh this page. Please check if the table structure has been changed.
sv: Kan inte spara gränssnittsattribut "%s". Ändringarna kommer inte vara beständiga efter att du uppdaterar denna sida. Kontrollera om tabellens struktur har förändrats.

source: %s argument(s) passed
sv: %s argument utförda

source: Temp disk rate
sv: Temporär diskanvändning

source: Fatal error: The navigation can only be accessed via AJAX
sv: Oåterkalleligt fel: Navigering kan endast nås via AJAX

source: Users cannot set a higher value
sv: Användare kan inte ange ett högre värde

source: Empty
sv: Töm

source: The maximum time to acquire a row lock, in milliseconds.
sv: Maximal tid för att skaffa ett radlås, i millisekunder.

source: The following structures have either been created or altered. Here you can:
sv: Följande strukturer har antingen skapats eller ändrats. Du kan:

source: Click to sort.
sv: Klicka för att sortera.

source: Database name
sv: Databasnamn

source: Empty the table (DELETE FROM)
sv: Töm tabellen (DELETE FROM)

source: Select a template
sv: Välj Mall

source: May
sv: maj

source: Adding primary key
sv: Lägg till primär nyckel

source: Request failed!!
sv: Begäran misslyckades!

source: Error 404! The page %s was not found.
sv: Fel 404! Sidan %s hittades inte.

source: Intended for storage of XML data
sv: Avsedd för lagring av XML-data

source: Hide find and replace criteria
sv: Dölj sök och ersätt kriterierna

source: You are not using https to access phpMyAdmin, therefore FIDO U2F device will most likely refuse to authenticate you.
sv: Du använder inte HTTPS för att komma åt phpMyAdmin, så FIDO U2F-enheten kommer troligen att vägra autentisera dig.

source: per day
sv: per dag

source: Generate password:
sv: Skapa lösenord:

source: per minute
sv: per minut

source: Routine parameters
sv: Rutinparametrar

source: Make consistent with central list
sv: Gör enhetlig med huvudlista

source: Dump all rows
sv: Exportera alla rader

source: Table name template
sv: Mall för tabellnamn

source: Error in processing request: No trigger with name %1$s found in database %2$s.
sv: Fel vid bearbetning av begäran: Ingen trigger med namnet %1$s hittades i databasen %2$s.

source: This field is required
sv: Detta fältet är obligatoriskt

source: New
sv: Ny

source: Increase {thread_cache_size}.
sv: Öka {thread_cache_size}.

source: MiB
sv: Mb

source: Add a primary key on existing column(s)
sv: Lägg till en primärnyckel för befintliga kolumner

source: General settings
sv: Generella inställningar

source: Repair table
sv: Reparera tabell

source: Allows the user to ask where the replicas / primaries are.
sv: Tillåter användaren att fråga var replikerna/primärservrarna finns.

source: Error code: %s
sv: Felkod: %s

source: This is ON if this server is a replica that is connected to a primary.
sv: Detta är ON om den här servern är en replik som är ansluten till en primär.

source: Simple two-factor authentication
sv: Enkel tvåfaktorsautentisering

source: User group
sv: Användargrupp

source: Last check:
sv: Senaste kontroll:

source: Consider increasing {open_files_limit}, and check the error log when restarting after changing {open_files_limit}.
sv: Överväg att öka {open_files_limit} och kontrollera felloggen vid omstart efter att ha ändrat {open_files_limit}.

source: Show functions in tree
sv: Visa funktioner som träd

source: Allows viewing processes of all users.
sv: Tillåter visning av processer för alla användare.

source: Delete the matches for the %s table?
sv: Ta bort resultat som matchar %s tabellen?

source: Converts an Internet network address in (IPv4/IPv6) format to binary
sv: Konverterar en Internet nätverksadress (IPv4/IPv6) format till ett binärt

source: Could not load the progress of the import.
sv: Kunde inte läsa av status på import.

source: "DROP DATABASE" statements are disabled.
sv: "DROP DATABASE"-satser är inaktiverade.
